Revit 2026 API

# ReferencePlaneName Property

---

The name property of the reference plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; set; }
```
```vb
Public Property Name As String
	Get
	Set
```
```cpp
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Name : string with get, set
```

#### Property Value

String

This property overrides Element's default implementation.

#### Reference

ReferencePlane Class

Autodesk.Revit.DB Namespace